**************************************************************************
*   Author :- Dhananjay
*   Date :- 1 - 04 - 2023
*   Purpose :- For God Sake Rewrite Entire Code in COBOL 
**************************************************************************


IDENTIFICATION DIVISION.
PROGRAM-ID. TWITTER-ALGORITHM.
DATA DIVISION .
FILE SECTION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
DISPLAY "Hello world"
STOP RUN.
END PROGRAM TWITTER-ALGORITHM.
MAIN-PROCEDURE.