COURSE_ACTS(COURSE_BOB, _("　１　ボムへいの　せんじょう"),
       _("やまのうえの　ボムキング")    , _("はくねつ　ノコノコレース")    , _("そらのしままで　ぶっとべ"),
       _("８まいの　あかコイン")        , _("そらにはばたけ　はねマリオ")  , _("ワンワンの　いぬごやで"))

COURSE_ACTS(COURSE_WF, _("　２　バッタンキングの　とりで"),
       _("いかりのバッタン　キング")    , _("とりでの　てっぺんへ")        , _("たいほうで　ひとっとび"),
       _("うきしまの　８まいコイン")    , _("とりかごへ　ストーン")        , _("たいほうで　ぶっこわせ！"))

COURSE_ACTS(COURSE_JRB, _("　３　かいぞくの　いりえ"),
       _("ちんぼつせんの　おたから")    , _("でてこい　きょだいウツボ")    , _("かいていどうくつの　おたから"),
       _("うかんだフネの　あかコイン")  , _("いわのはしらへ　ひとっとび")  , _("ふきだす　みずを　くぐれ"))

COURSE_ACTS(COURSE_CCM, _("　４　さむいさむい　マウンテン"),
       _("スーパースノースライダー")    , _("まいごの　こペンギン")        , _("ペンギン　チャンピオンレース"),
       _("すべって　８まいあかコイン")  , _("ゴロゴロ　ゆきダルマ")        , _("かくれ　スーパー　カベキック"))

COURSE_ACTS(COURSE_BBH, _("　５　テレサの　ホラーハウス"),
       _("おやかたテレサを　さがせ")    , _("テレサの　メリーゴーランド")  , _("ほんだなオバケの　ナゾ"),
       _("８まいコインは　どこだ")      , _("バルコニーの　ボステレサ")    , _("かくしべやの　おおめだま"))

COURSE_ACTS(COURSE_HMC, _("　６　やみにとける　どうくつ"),
       _("ドッシーのいる　ちていこ")    , _("そうさリフトの　あかコイン")  , _("メタルで　ダッシュ"),
       _("ケムリめいろを　ぬけて")      , _("ケムリめいろの　ひじょうぐち"), _("ゴロゴロいわの　ひみつ"))

COURSE_ACTS(COURSE_LLL, _("　７　ファイアバブル　ランド"),
       _("おとせ　ボスどんけつ")        , _("たたかえ！どんけつたい")      , _("１５パズルの　８まいコイン"),
       _("コロコロ　まるたわたり")      , _("かざんの　パワースター")      , _("かざんの　リフトツアー"))

COURSE_ACTS(COURSE_SSL, _("　８　あっちっち　さばく"),
       _("いたずらハゲたか　ジャンゴ")  , _("ピラミッドの　てっぺんで")    , _("きょだいピラミッドの　ないぶ"),
       _("４つのはしらに　たつものへ")  , _("とびまわれ　８まいコイン")    , _("きょだいピラミッドのナゾ"))

COURSE_ACTS(COURSE_DDD, _("　９　ウォーター　ランド"),
       _("クッパの　せんすいかん")      , _("うずしおの　たからばこ")      , _("にげたクッパの　あかコイン"),
       _("ふきだす　みずを　くぐれ")    , _("マンタの　おくりもの")        , _("ボウシが　そろったら"))

COURSE_ACTS(COURSE_SL, _("１０　スノーマンズ　ランド"),
       _("おおゆきダルマの　おでこ")    , _("こおりのくにの　どんけつ")    , _("こおりの　オブジェ"),
       _("つめたい　いけを　こえて")    , _("コウラにのって　あかコイン")  , _("フワフワさんの　おうち"))

COURSE_ACTS(COURSE_WDW, _("１１　みずびたシティー"),
       _("ビリビリの　まめリフト")      , _("トップオブ　ザ　シティー")    , _("あさせと　そらのシークレット"),
       _("いそげ！かなあみエレベーター"), _("ダウンタウンの　あかコイン")  , _("ダウンタウンを　かけろ"))

COURSE_ACTS(COURSE_TTM, _("１２　たかいたかいマウンテン"),
       _("たかいたかい　やまのうえ")    , _("いたずらザル　ウッキィのオリ"), _("おばけキノコの　あかコイン"),
       _("マウンテン　スライダー")      , _("はしのうえから　みわたせば")  , _("ぶっとべ　はなれキノコへ"))

COURSE_ACTS(COURSE_THI, _("１３　ちびでか　アイランド"),
       _("きょだいパックンフラワー")    , _("デカじまの　てっぺんで")      , _("ノコノコ　リターンマッチ"),
       _("チビじまの　５シークレット")  , _("ハナチャンの　あかコイン")    , _("イカリの　ハナチャン"))

COURSE_ACTS(COURSE_TTC, _("１４　チックタックロック"),
       _("グルグル　かごのなかへ")      , _("ふりこの　へや")              , _("チックタックはりの　うえ"),
       _("えっへん　てっぺん　ドッスン"), _("つきだしを　のりこえて")      , _("００ふんの　あかコイン"))

COURSE_ACTS(COURSE_RR, _("１５　レインボー　クルーズ"),
       _("にじを　わたる　ふね")        , _("てんくうの　おやしき")        , _("タテめいろの　あかコイン"),
       _("カゼきる　きょだいブランコ")  , _("おおぞら　アスレチック")      , _("にじの　かなたの　しま"))

SECRET_STAR(COURSE_BITDW,    _("　　　やみの　せかいの　クッパ"))
SECRET_STAR(COURSE_BITFS,    _("　　　ほのおの　うみの　クッパ"))
SECRET_STAR(COURSE_BITS,     _("　　　てんくうの　たたかい！"))
SECRET_STAR(COURSE_PSS,      _("　　　ピーチのかくれスライダー"))
SECRET_STAR(COURSE_COTMC,    _("　　　メタルスイッチの　たき"))
SECRET_STAR(COURSE_TOTWC,    _("　　　はばたけ！はねスイッチへ"))
SECRET_STAR(COURSE_VCUTM,    _("　　　おほりのとうめいスイッチ"))
SECRET_STAR(COURSE_WMOTR,    _("　　　にじ　かける　はねマリオ"))
SECRET_STAR(COURSE_SA,       _("　　　おさかなと　いっしょ"))
SECRET_STAR(COURSE_CAKE_END, _("　　　おいしいケーキ"))

CASTLE_SECRET_STARS(_("　　　おしろのかくれスター"))

EXTRA_TEXT(0, _("おしろのかくれスター"))
EXTRA_TEXT(1, _("１００まいコインの　スター"))
EXTRA_TEXT(2, _("マウンテンのへやが　ひらく！"))
EXTRA_TEXT(3, _("みずとゆき２つのへやが　ひらく！"))
EXTRA_TEXT(4, _("おおきなほしの　ドアがひらく！"))
EXTRA_TEXT(5, _("クッパへの　とびらがひらく！"))
EXTRA_TEXT(6, _("３がいへの　とびらがひらく！"))
